{"_id":"SR 120100526000569","Tag":"[\"#QuickResponse\",\"#BeyondExpectations\"]","Engineer":"Yinsong Zhao","CustomerVoice":"“Very good service and quick response time”\n","Date":"10-19-2020 - 10-25-2020","sortDate":"20201019","Badge":["/upload/High Quality.png","/upload/Efficient.png"],"Story":"The enterprise Transport for NSW needed to trigger the Build Pipeline of Azure DevOps during the running process of Azure Data Factory and view the completion status in real time. Our Support Engineer Yinsong Zhao provided professional solutions which is invoking Azure DevOps REST API in PowerShell script. He communicated with customer promptly in remote sessions through Microsoft Teams. Besides, he wrote sample code as an additional value. During the process, Yinsong thought from customer’s perspective and delivered more complete and easy-to-understand resolution than customer’s original expectation. \n"}
{"_id":"SR 120100222000033","Tag":"[\"OneMicrosoft\",\"Rescue\"]","Engineer":"Alex Chong","CustomerVoice":"“… I think Alex demonstrated one good example of “One Microsoft”, the case or task is none of his workload, but he is bravely to jump in and help the customers who are already upset now. His technique skill and willingness to help brother teams is something I really want to highlight. …”    \n   -- from Linru Hui, Azure App Service\n","Date":"10-26-2020 - 11-01-2020","sortDate":"20201026","Badge":[],"Story":"Kongsberg Digital AS experienced production Azure Web App down with HTTP 500 errors. Although the issue was mitigated, customer concerned about potential risk and was eager to figure out root cause to avoid impact in the future. SR owner collaborated with one DevOps engineer but with slow progress due to time zone difference, which made customer's temperature hot. In this urgent situation, Alex Chong stepped in and rescued the customer experience timely. He successfully identified the problem and shared the suggestions with SR owner, so that the troubleshooting could move forward. \n"}
{"_id":"SR 120081423000817","Tag":"[\"TechnicalExpertise\",\"SuperiorCustomerExperience\"]","Engineer":"Cynthia Jiang","CustomerVoice":"\"Great detailed investigation and analysis of the issue. The in depth insights provided us the necessary direction in determining and addressing the issue\"   \n-- from Australia Public Transport Authority\n","Date":"11-02-2020 - 11-08-2020","sortDate":"20201102","Badge":["/upload/High Quality.png","/upload/Resourceful.png"],"Story":"Western Australia Public Transport Authority raised the performance issue of high memory related to IIS on production environment. Cynthia Jiang demonstrated her technical expertise in the case working with the customer. Her accountability and efforts on the case and the customer are highly recognized by them which directed the customers to the bottom of the issue. As a result, Cynthia’s outstanding support was warmly praised by the customer. Bravo!\n"}
{"_id":"SR 120101423000869","Tag":"[\"#GoodListener\",\"#Attentiveness\"]","Engineer":"Wenli Xing","CustomerVoice":"\"Guidance was precise and professional, thank you!\"   \n\n-- from Fastbrick Robotics Limited","Date":"11-09-2020 - 11-15-2020","sortDate":"20201109","Badge":["/upload/Empathetic.png","/upload/Communicate Effectively.png"],"Story":"Fastbrick Robotics Limited raised the case originally related to ARM template deployment issue using Azure DevOps. While during the troubleshooting period, customer suddenly changed the topic to a billing issue. Instead of requesting customer to raise a new support ticket, Support engineer Wenli Xing directly re-acted and scheduled remote session with customer to continue working on the new issue. She precisely confirmed the customer’s real pain points and promptly provided an answer which helped customer save the cost and avoid unnecessary expenses.\n"}
